app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
      @organization = Organization.create(members: [@user])
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ('Werner', 'werpet@gmail.com', '$2a$12$icHxnrQ0cHXXgbxZGu974ucgzvkCtuU.tL2ru9sVO9hmS10eSXwb6', '2024-11-26 10:11:51.241772', '2024-11-26 10:11:51.241772') RETURNING "id"
INSERT INTO "organizations" ("created_at", "updated_at") VALUES ('2024-11-26 10:11:51.298962', '2024-11-26 10:11:51.298962') RETURNING "id"